examples/channel_flow_Re_tau_180/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1806/v10                             |
|   \  /    A nd           | Web:      https://www.OpenFOAM.com              |
|    \/     M anipulation  |           https://www.OpenFOAM.org              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;

vertices
(
	(0.00000000 28.00000000 63.00000000) // 0
	(4.06451613 27.96927050 63.00000000) // 1
	(4.06451613 27.96927050 -63.00000000) // 2
	(0.00000000 28.00000000 -63.00000000) // 3
	(0.00000000 84.00000000 63.00000000) // 4
	(4.06451613 84.00000000 63.00000000) // 5
	(4.06451613 84.00000000 -63.00000000) // 6
	(0.00000000 84.00000000 -63.00000000) // 7
	(8.12903226 27.30645941 63.00000000) // 8
	(8.12903226 27.30645941 -63.00000000) // 9
	(8.12903226 84.00000000 63.00000000) // 10
	(8.12903226 84.00000000 -63.00000000) // 11
	(12.19354839 25.28638016 63.00000000) // 12
	(12.19354839 25.28638016 -63.00000000) // 13
	(12.19354839 84.00000000 63.00000000) // 14
	(12.19354839 84.00000000 -63.00000000) // 15
	(16.25806452 22.19270668 63.00000000) // 16
	(16.25806452 22.19270668 -63.00000000) // 17
	(16.25806452 84.00000000 63.00000000) // 18
	(16.25806452 84.00000000 -63.00000000) // 19
	(20.32258065 18.72663945 63.00000000) // 20
	(20.32258065 18.72663945 -63.00000000) // 21
	(20.32258065 84.00000000 63.00000000) // 22
	(20.32258065 84.00000000 -63.00000000) // 23
	(24.38709677 15.39038851 63.00000000) // 24
	(24.38709677 15.39038851 -63.00000000) // 25
	(24.38709677 84.00000000 63.00000000) // 26
	(24.38709677 84.00000000 -63.00000000) // 27
	(28.45161290 12.19661267 63.00000000) // 28
	(28.45161290 12.19661267 -63.00000000) // 29
	(28.45161290 84.00000000 63.00000000) // 30
	(28.45161290 84.00000000 -63.00000000) // 31
	(32.51612903 9.07520046 63.00000000) // 32
	(32.51612903 9.07520046 -63.00000000) // 33
	(32.51612903 84.00000000 63.00000000) // 34
	(32.51612903 84.00000000 -63.00000000) // 35
	(36.58064516 6.14074652 63.00000000) // 36
	(36.58064516 6.14074652 -63.00000000) // 37
	(36.58064516 84.00000000 63.00000000) // 38
	(36.58064516 84.00000000 -63.00000000) // 39
	(40.64516129 3.64290894 63.00000000) // 40
	(40.64516129 3.64290894 -63.00000000) // 41
	(40.64516129 84.00000000 63.00000000) // 42
	(40.64516129 84.00000000 -63.00000000) // 43
	(44.70967742 1.77230407 63.00000000) // 44
	(44.70967742 1.77230407 -63.00000000) // 45
	(44.70967742 84.00000000 63.00000000) // 46
	(44.70967742 84.00000000 -63.00000000) // 47
	(48.77419355 0.56373726 63.00000000) // 48
	(48.77419355 0.56373726 -63.00000000) // 49
	(48.77419355 84.00000000 63.00000000) // 50
	(48.77419355 84.00000000 -63.00000000) // 51
	(52.83870968 0.02798550 63.00000000) // 52
	(52.83870968 0.02798550 -63.00000000) // 53
	(52.83870968 84.00000000 63.00000000) // 54
	(52.83870968 84.00000000 -63.00000000) // 55
	(56.90322581 0.00000000 63.00000000) // 56
	(56.90322581 0.00000000 -63.00000000) // 57
	(56.90322581 84.00000000 63.00000000) // 58
	(56.90322581 84.00000000 -63.00000000) // 59
	(60.96774194 0.00000000 63.00000000) // 60
	(60.96774194 0.00000000 -63.00000000) // 61
	(60.96774194 84.00000000 63.00000000) // 62
	(60.96774194 84.00000000 -63.00000000) // 63
	(65.03225806 0.00000000 63.00000000) // 64
	(65.03225806 0.00000000 -63.00000000) // 65
	(65.03225806 84.00000000 63.00000000) // 66
	(65.03225806 84.00000000 -63.00000000) // 67
	(69.09677419 0.00000000 63.00000000) // 68
	(69.09677419 0.00000000 -63.00000000) // 69
	(69.09677419 84.00000000 63.00000000) // 70
	(69.09677419 84.00000000 -63.00000000) // 71
	(73.16129032 0.00000000 63.00000000) // 72
	(73.16129032 0.00000000 -63.00000000) // 73
	(73.16129032 84.00000000 63.00000000) // 74
	(73.16129032 84.00000000 -63.00000000) // 75
	(77.22580645 0.00000000 63.00000000) // 76
	(77.22580645 0.00000000 -63.00000000) // 77
	(77.22580645 84.00000000 63.00000000) // 78
	(77.22580645 84.00000000 -63.00000000) // 79
	(81.29032258 0.00000000 63.00000000) // 80
	(81.29032258 0.00000000 -63.00000000) // 81
	(81.29032258 84.00000000 63.00000000) // 82
	(81.29032258 84.00000000 -63.00000000) // 83
	(85.35483871 0.00000000 63.00000000) // 84
	(85.35483871 0.00000000 -63.00000000) // 85
	(85.35483871 84.00000000 63.00000000) // 86
	(85.35483871 84.00000000 -63.00000000) // 87
	(89.41935484 0.00000000 63.00000000) // 88
	(89.41935484 0.00000000 -63.00000000) // 89
	(89.41935484 84.00000000 63.00000000) // 90
	(89.41935484 84.00000000 -63.00000000) // 91
	(93.48387097 0.00000000 63.00000000) // 92
	(93.48387097 0.00000000 -63.00000000) // 93
	(93.48387097 84.00000000 63.00000000) // 94
	(93.48387097 84.00000000 -63.00000000) // 95
	(97.54838710 0.00000000 63.00000000) // 96
	(97.54838710 0.00000000 -63.00000000) // 97
	(97.54838710 84.00000000 63.00000000) // 98
	(97.54838710 84.00000000 -63.00000000) // 99
	(101.61290323 0.00000000 63.00000000) // 100
	(101.61290323 0.00000000 -63.00000000) // 101
	(101.61290323 84.00000000 63.00000000) // 102
	(101.61290323 84.00000000 -63.00000000) // 103
	(105.67741935 0.00000000 63.00000000) // 104
	(105.67741935 0.00000000 -63.00000000) // 105
	(105.67741935 84.00000000 63.00000000) // 106
	(105.67741935 84.00000000 -63.00000000) // 107
	(109.74193548 0.00000000 63.00000000) // 108
	(109.74193548 0.00000000 -63.00000000) // 109
	(109.74193548 84.00000000 63.00000000) // 110
	(109.74193548 84.00000000 -63.00000000) // 111
	(113.80645161 0.00000000 63.00000000) // 112
	(113.80645161 0.00000000 -63.00000000) // 113
	(113.80645161 84.00000000 63.00000000) // 114
	(113.80645161 84.00000000 -63.00000000) // 115
	(117.87096774 0.00000000 63.00000000) // 116
	(117.87096774 0.00000000 -63.00000000) // 117
	(117.87096774 84.00000000 63.00000000) // 118
	(117.87096774 84.00000000 -63.00000000) // 119
	(121.93548387 0.00000000 63.00000000) // 120
	(121.93548387 0.00000000 -63.00000000) // 121
	(121.93548387 84.00000000 63.00000000) // 122
	(121.93548387 84.00000000 -63.00000000) // 123
	(126.00000000 0.00000000 63.00000000) // 124
	(126.00000000 0.00000000 -63.00000000) // 125
	(126.00000000 84.00000000 63.00000000) // 126
	(126.00000000 84.00000000 -63.00000000) // 127
	(130.06451613 0.00000000 63.00000000) // 128
	(130.06451613 0.00000000 -63.00000000) // 129
	(130.06451613 84.00000000 63.00000000) // 130
	(130.06451613 84.00000000 -63.00000000) // 131
	(134.12903226 0.00000000 63.00000000) // 132
	(134.12903226 0.00000000 -63.00000000) // 133
	(134.12903226 84.00000000 63.00000000) // 134
	(134.12903226 84.00000000 -63.00000000) // 135
	(138.19354839 0.00000000 63.00000000) // 136
	(138.19354839 0.00000000 -63.00000000) // 137
	(138.19354839 84.00000000 63.00000000) // 138
	(138.19354839 84.00000000 -63.00000000) // 139
	(142.25806452 0.00000000 63.00000000) // 140
	(142.25806452 0.00000000 -63.00000000) // 141
	(142.25806452 84.00000000 63.00000000) // 142
	(142.25806452 84.00000000 -63.00000000) // 143
	(146.32258065 0.00000000 63.00000000) // 144
	(146.32258065 0.00000000 -63.00000000) // 145
	(146.32258065 84.00000000 63.00000000) // 146
	(146.32258065 84.00000000 -63.00000000) // 147
	(150.38709677 0.00000000 63.00000000) // 148
	(150.38709677 0.00000000 -63.00000000) // 149
	(150.38709677 84.00000000 63.00000000) // 150
	(150.38709677 84.00000000 -63.00000000) // 151
	(154.45161290 0.00000000 63.00000000) // 152
	(154.45161290 0.00000000 -63.00000000) // 153
	(154.45161290 84.00000000 63.00000000) // 154
	(154.45161290 84.00000000 -63.00000000) // 155
	(158.51612903 0.00000000 63.00000000) // 156
	(158.51612903 0.00000000 -63.00000000) // 157
	(158.51612903 84.00000000 63.00000000) // 158
	(158.51612903 84.00000000 -63.00000000) // 159
	(162.58064516 0.00000000 63.00000000) // 160
	(162.58064516 0.00000000 -63.00000000) // 161
	(162.58064516 84.00000000 63.00000000) // 162
	(162.58064516 84.00000000 -63.00000000) // 163
	(166.64516129 0.00000000 63.00000000) // 164
	(166.64516129 0.00000000 -63.00000000) // 165
	(166.64516129 84.00000000 63.00000000) // 166
	(166.64516129 84.00000000 -63.00000000) // 167
	(170.70967742 0.00000000 63.00000000) // 168
	(170.70967742 0.00000000 -63.00000000) // 169
	(170.70967742 84.00000000 63.00000000) // 170
	(170.70967742 84.00000000 -63.00000000) // 171
	(174.77419355 0.00000000 63.00000000) // 172
	(174.77419355 0.00000000 -63.00000000) // 173
	(174.77419355 84.00000000 63.00000000) // 174
	(174.77419355 84.00000000 -63.00000000) // 175
	(178.83870968 0.00000000 63.00000000) // 176
	(178.83870968 0.00000000 -63.00000000) // 177
	(178.83870968 84.00000000 63.00000000) // 178
	(178.83870968 84.00000000 -63.00000000) // 179
	(182.90322581 0.00000000 63.00000000) // 180
	(182.90322581 0.00000000 -63.00000000) // 181
	(182.90322581 84.00000000 63.00000000) // 182
	(182.90322581 84.00000000 -63.00000000) // 183
	(186.96774194 0.00000000 63.00000000) // 184
	(186.96774194 0.00000000 -63.00000000) // 185
	(186.96774194 84.00000000 63.00000000) // 186
	(186.96774194 84.00000000 -63.00000000) // 187
	(191.03225806 0.00000000 63.00000000) // 188
	(191.03225806 0.00000000 -63.00000000) // 189
	(191.03225806 84.00000000 63.00000000) // 190
	(191.03225806 84.00000000 -63.00000000) // 191
	(195.09677419 0.00000000 63.00000000) // 192
	(195.09677419 0.00000000 -63.00000000) // 193
	(195.09677419 84.00000000 63.00000000) // 194
	(195.09677419 84.00000000 -63.00000000) // 195
	(199.16129032 0.02798550 63.00000000) // 196
	(199.16129032 0.02798550 -63.00000000) // 197
	(199.16129032 84.00000000 63.00000000) // 198
	(199.16129032 84.00000000 -63.00000000) // 199
	(203.22580645 0.56373726 63.00000000) // 200
	(203.22580645 0.56373726 -63.00000000) // 201
	(203.22580645 84.00000000 63.00000000) // 202
	(203.22580645 84.00000000 -63.00000000) // 203
	(207.29032258 1.77230407 63.00000000) // 204
	(207.29032258 1.77230407 -63.00000000) // 205
	(207.29032258 84.00000000 63.00000000) // 206
	(207.29032258 84.00000000 -63.00000000) // 207
	(211.35483871 3.64290894 63.00000000) // 208
	(211.35483871 3.64290894 -63.00000000) // 209
	(211.35483871 84.00000000 63.00000000) // 210
	(211.35483871 84.00000000 -63.00000000) // 211
	(215.41935484 6.14074652 63.00000000) // 212
	(215.41935484 6.14074652 -63.00000000) // 213
	(215.41935484 84.00000000 63.00000000) // 214
	(215.41935484 84.00000000 -63.00000000) // 215
	(219.48387097 9.07520046 63.00000000) // 216
	(219.48387097 9.07520046 -63.00000000) // 217
	(219.48387097 84.00000000 63.00000000) // 218
	(219.48387097 84.00000000 -63.00000000) // 219
	(223.54838710 12.19661267 63.00000000) // 220
	(223.54838710 12.19661267 -63.00000000) // 221
	(223.54838710 84.00000000 63.00000000) // 222
	(223.54838710 84.00000000 -63.00000000) // 223
	(227.61290323 15.39038851 63.00000000) // 224
	(227.61290323 15.39038851 -63.00000000) // 225
	(227.61290323 84.00000000 63.00000000) // 226
	(227.61290323 84.00000000 -63.00000000) // 227
	(231.67741935 18.72663945 63.00000000) // 228
	(231.67741935 18.72663945 -63.00000000) // 229
	(231.67741935 84.00000000 63.00000000) // 230
	(231.67741935 84.00000000 -63.00000000) // 231
	(235.74193548 22.19270668 63.00000000) // 232
	(235.74193548 22.19270668 -63.00000000) // 233
	(235.74193548 84.00000000 63.00000000) // 234
	(235.74193548 84.00000000 -63.00000000) // 235
	(239.80645161 25.28638016 63.00000000) // 236
	(239.80645161 25.28638016 -63.00000000) // 237
	(239.80645161 84.00000000 63.00000000) // 238
	(239.80645161 84.00000000 -63.00000000) // 239
	(243.87096774 27.30645941 63.00000000) // 240
	(243.87096774 27.30645941 -63.00000000) // 241
	(243.87096774 84.00000000 63.00000000) // 242
	(243.87096774 84.00000000 -63.00000000) // 243
	(247.93548387 27.96927050 63.00000000) // 244
	(247.93548387 27.96927050 -63.00000000) // 245
	(247.93548387 84.00000000 63.00000000) // 246
	(247.93548387 84.00000000 -63.00000000) // 247
	(252.00000000 28.00000000 63.00000000) // 248
	(252.00000000 28.00000000 -63.00000000) // 249
	(252.00000000 84.00000000 63.00000000) // 250
	(252.00000000 84.00000000 -63.00000000) // 251
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 0 
	hex ( 1 8 9 2 5 10 11 6 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 1 
	hex ( 8 12 13 9 10 14 15 11 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 2 
	hex ( 12 16 17 13 14 18 19 15 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 3 
	hex ( 16 20 21 17 18 22 23 19 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 4 
	hex ( 20 24 25 21 22 26 27 23 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 5 
	hex ( 24 28 29 25 26 30 31 27 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 6 
	hex ( 28 32 33 29 30 34 35 31 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 7 
	hex ( 32 36 37 33 34 38 39 35 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 8 
	hex ( 36 40 41 37 38 42 43 39 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 9 
	hex ( 40 44 45 41 42 46 47 43 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 10 
	hex ( 44 48 49 45 46 50 51 47 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 11 
	hex ( 48 52 53 49 50 54 55 51 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 12 
	hex ( 52 56 57 53 54 58 59 55 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 13 
	hex ( 56 60 61 57 58 62 63 59 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 14 
	hex ( 60 64 65 61 62 66 67 63 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 15 
	hex ( 64 68 69 65 66 70 71 67 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 16 
	hex ( 68 72 73 69 70 74 75 71 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 17 
	hex ( 72 76 77 73 74 78 79 75 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 18 
	hex ( 76 80 81 77 78 82 83 79 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 19 
	hex ( 80 84 85 81 82 86 87 83 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 20 
	hex ( 84 88 89 85 86 90 91 87 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 21 
	hex ( 88 92 93 89 90 94 95 91 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 22 
	hex ( 92 96 97 93 94 98 99 95 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 23 
	hex ( 96 100 101 97 98 102 103 99 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 24 
	hex ( 100 104 105 101 102 106 107 103 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 25 
	hex ( 104 108 109 105 106 110 111 107 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 26 
	hex ( 108 112 113 109 110 114 115 111 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 27 
	hex ( 112 116 117 113 114 118 119 115 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 28 
	hex ( 116 120 121 117 118 122 123 119 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 29 
	hex ( 120 124 125 121 122 126 127 123 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 30 
	hex ( 124 128 129 125 126 130 131 127 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 31 
	hex ( 128 132 133 129 130 134 135 131 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 32 
	hex ( 132 136 137 133 134 138 139 135 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 33 
	hex ( 136 140 141 137 138 142 143 139 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 34 
	hex ( 140 144 145 141 142 146 147 143 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 35 
	hex ( 144 148 149 145 146 150 151 147 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 36 
	hex ( 148 152 153 149 150 154 155 151 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 37 
	hex ( 152 156 157 153 154 158 159 155 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 38 
	hex ( 156 160 161 157 158 162 163 159 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 39 
	hex ( 160 164 165 161 162 166 167 163 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 40 
	hex ( 164 168 169 165 166 170 171 167 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 41 
	hex ( 168 172 173 169 170 174 175 171 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 42 
	hex ( 172 176 177 173 174 178 179 175 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 43 
	hex ( 176 180 181 177 178 182 183 179 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 44 
	hex ( 180 184 185 181 182 186 187 183 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 45 
	hex ( 184 188 189 185 186 190 191 187 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 46 
	hex ( 188 192 193 189 190 194 195 191 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 47 
	hex ( 192 196 197 193 194 198 199 195 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 48 
	hex ( 196 200 201 197 198 202 203 199 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 49 
	hex ( 200 204 205 201 202 206 207 203 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 50 
	hex ( 204 208 209 205 206 210 211 207 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 51 
	hex ( 208 212 213 209 210 214 215 211 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 52 
	hex ( 212 216 217 213 214 218 219 215 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 53 
	hex ( 216 220 221 217 218 222 223 219 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 54 
	hex ( 220 224 225 221 222 226 227 223 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 55 
	hex ( 224 228 229 225 226 230 231 227 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 56 
	hex ( 228 232 233 229 230 234 235 231 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 57 
	hex ( 232 236 237 233 234 238 239 235 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 58 
	hex ( 236 240 241 237 238 242 243 239 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 59 
	hex ( 240 244 245 241 242 246 247 243 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 60 
	hex ( 244 248 249 245 246 250 251 247 )  ( 1 34 44 ) simpleGrading ( 1 1 ((0.5 22 14.084463204404132)(0.5 22 0.07100022098728655)) ) // 61 
);

edges
(
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
);

faces
(
);

boundary
(
	bottomWall
	{
		type wall;
		faces
		(
			(0 1 2 3)
			(1 8 9 2)
			(8 12 13 9)
			(12 16 17 13)
			(16 20 21 17)
			(20 24 25 21)
			(24 28 29 25)
			(28 32 33 29)
			(32 36 37 33)
			(36 40 41 37)
			(40 44 45 41)
			(44 48 49 45)
			(48 52 53 49)
			(52 56 57 53)
			(56 60 61 57)
			(60 64 65 61)
			(64 68 69 65)
			(68 72 73 69)
			(72 76 77 73)
			(76 80 81 77)
			(80 84 85 81)
			(84 88 89 85)
			(88 92 93 89)
			(92 96 97 93)
			(96 100 101 97)
			(100 104 105 101)
			(104 108 109 105)
			(108 112 113 109)
			(112 116 117 113)
			(116 120 121 117)
			(120 124 125 121)
			(124 128 129 125)
			(128 132 133 129)
			(132 136 137 133)
			(136 140 141 137)
			(140 144 145 141)
			(144 148 149 145)
			(148 152 153 149)
			(152 156 157 153)
			(156 160 161 157)
			(160 164 165 161)
			(164 168 169 165)
			(168 172 173 169)
			(172 176 177 173)
			(176 180 181 177)
			(180 184 185 181)
			(184 188 189 185)
			(188 192 193 189)
			(192 196 197 193)
			(196 200 201 197)
			(200 204 205 201)
			(204 208 209 205)
			(208 212 213 209)
			(212 216 217 213)
			(216 220 221 217)
			(220 224 225 221)
			(224 228 229 225)
			(228 232 233 229)
			(232 236 237 233)
			(236 240 241 237)
			(240 244 245 241)
			(244 248 249 245)
		);
	}
	topWall
	{
		type wall;
		faces
		(
			(4 5 6 7)
			(5 10 11 6)
			(10 14 15 11)
			(14 18 19 15)
			(18 22 23 19)
			(22 26 27 23)
			(26 30 31 27)
			(30 34 35 31)
			(34 38 39 35)
			(38 42 43 39)
			(42 46 47 43)
			(46 50 51 47)
			(50 54 55 51)
			(54 58 59 55)
			(58 62 63 59)
			(62 66 67 63)
			(66 70 71 67)
			(70 74 75 71)
			(74 78 79 75)
			(78 82 83 79)
			(82 86 87 83)
			(86 90 91 87)
			(90 94 95 91)
			(94 98 99 95)
			(98 102 103 99)
			(102 106 107 103)
			(106 110 111 107)
			(110 114 115 111)
			(114 118 119 115)
			(118 122 123 119)
			(122 126 127 123)
			(126 130 131 127)
			(130 134 135 131)
			(134 138 139 135)
			(138 142 143 139)
			(142 146 147 143)
			(146 150 151 147)
			(150 154 155 151)
			(154 158 159 155)
			(158 162 163 159)
			(162 166 167 163)
			(166 170 171 167)
			(170 174 175 171)
			(174 178 179 175)
			(178 182 183 179)
			(182 186 187 183)
			(186 190 191 187)
			(190 194 195 191)
			(194 198 199 195)
			(198 202 203 199)
			(202 206 207 203)
			(206 210 211 207)
			(210 214 215 211)
			(214 218 219 215)
			(218 222 223 219)
			(222 226 227 223)
			(226 230 231 227)
			(230 234 235 231)
			(234 238 239 235)
			(238 242 243 239)
			(242 246 247 243)
			(246 250 251 247)
		);
	}
	right
	{
		type cyclic;
		neighbourPatch    left;
		faces
		(
			(4 5 1 0)
			(5 10 8 1)
			(10 14 12 8)
			(14 18 16 12)
			(18 22 20 16)
			(22 26 24 20)
			(26 30 28 24)
			(30 34 32 28)
			(34 38 36 32)
			(38 42 40 36)
			(42 46 44 40)
			(46 50 48 44)
			(50 54 52 48)
			(54 58 56 52)
			(58 62 60 56)
			(62 66 64 60)
			(66 70 68 64)
			(70 74 72 68)
			(74 78 76 72)
			(78 82 80 76)
			(82 86 84 80)
			(86 90 88 84)
			(90 94 92 88)
			(94 98 96 92)
			(98 102 100 96)
			(102 106 104 100)
			(106 110 108 104)
			(110 114 112 108)
			(114 118 116 112)
			(118 122 120 116)
			(122 126 124 120)
			(126 130 128 124)
			(130 134 132 128)
			(134 138 136 132)
			(138 142 140 136)
			(142 146 144 140)
			(146 150 148 144)
			(150 154 152 148)
			(154 158 156 152)
			(158 162 160 156)
			(162 166 164 160)
			(166 170 168 164)
			(170 174 172 168)
			(174 178 176 172)
			(178 182 180 176)
			(182 186 184 180)
			(186 190 188 184)
			(190 194 192 188)
			(194 198 196 192)
			(198 202 200 196)
			(202 206 204 200)
			(206 210 208 204)
			(210 214 212 208)
			(214 218 216 212)
			(218 222 220 216)
			(222 226 224 220)
			(226 230 228 224)
			(230 234 232 228)
			(234 238 236 232)
			(238 242 240 236)
			(242 246 244 240)
			(246 250 248 244)
		);
	}
	left
	{
		type cyclic;
		neighbourPatch    right;
		faces
		(
			(7 6 2 3)
			(6 11 9 2)
			(11 15 13 9)
			(15 19 17 13)
			(19 23 21 17)
			(23 27 25 21)
			(27 31 29 25)
			(31 35 33 29)
			(35 39 37 33)
			(39 43 41 37)
			(43 47 45 41)
			(47 51 49 45)
			(51 55 53 49)
			(55 59 57 53)
			(59 63 61 57)
			(63 67 65 61)
			(67 71 69 65)
			(71 75 73 69)
			(75 79 77 73)
			(79 83 81 77)
			(83 87 85 81)
			(87 91 89 85)
			(91 95 93 89)
			(95 99 97 93)
			(99 103 101 97)
			(103 107 105 101)
			(107 111 109 105)
			(111 115 113 109)
			(115 119 117 113)
			(119 123 121 117)
			(123 127 125 121)
			(127 131 129 125)
			(131 135 133 129)
			(135 139 137 133)
			(139 143 141 137)
			(143 147 145 141)
			(147 151 149 145)
			(151 155 153 149)
			(155 159 157 153)
			(159 163 161 157)
			(163 167 165 161)
			(167 171 169 165)
			(171 175 173 169)
			(175 179 177 173)
			(179 183 181 177)
			(183 187 185 181)
			(187 191 189 185)
			(191 195 193 189)
			(195 199 197 193)
			(199 203 201 197)
			(203 207 205 201)
			(207 211 209 205)
			(211 215 213 209)
			(215 219 217 213)
			(219 223 221 217)
			(223 227 225 221)
			(227 231 229 225)
			(231 235 233 229)
			(235 239 237 233)
			(239 243 241 237)
			(243 247 245 241)
			(247 251 249 245)
		);
	}
	inlet
	{
		type cyclic;
		neighbourPatch    outlet;
		faces
		(
			(4 0 3 7)
		);
	}
	outlet
	{
		type cyclic;
		neighbourPatch    inlet;
		faces
		(
			(250 248 249 251)
		);
	}
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Created with classy_blocks: https://github.com/damogranlabs/classy_blocks //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
